import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","desc","type","attrType","attrValue","Magnification","pendantId","attrSwitch"],["","","","","","","",""],[1001,"凤舞九天",1,[204],[5],[1.2,1.5,2],[7],1],[1002,"血蝠",1,[102,208],[100,5],[1.2,1.5,2],[8],1],[1003,"丘比特",1,[102,203],[200,5],[1.2,1.5,2],[9],1],[1004,"暗夜",1,[205,211],[10,5],[1.2,1.5,2],[10],1],[1005,"爱心天使",1,[102,203],[300,15],[1.2,1.5,2],[11],1],[1006,"星云",1,[205],[45],[1.2,1.5,2],[17],1],[1007,"绿野仙踪",1,[201],[50],[1.2,1.5,2],[24],1],[1008,"玄鸟",1,[204],[15],[1.2,1.5,2],[25],1],[2001,"彗星拖尾",2,[204],[5],[1.2,1.5,2],[12],1],[2002,"启明星",2,[102],[100],[1.2,1.5,2],[13],1],[2003,"冰雪",2,[203],[3],[1.2,1.5,2],[14],1],[2004,"糖果",2,[102],[500],[1.2,1.5,2],[15],1],[2005,"枫叶",2,[204,208],[15,10],[1.2,1.5,2],[16],1],[2006,"六芒星",2,[112],[5],[1.2,1.5,2],[18],1],[2007,"彩虹",2,[203],[15],[1.2,1.5,2],[26],1],[2008,"足球",2,[211],[35],[1.2,1.5,2],[27],1],[2009,"星光",2,[201,203],[50,25],[1.2,1.5,2],[47],1],[3001,"击杀特效·爆炸",3,null,null,null,[19],0],[3002,"击杀特效·小恶魔",3,null,null,null,[20],0],[3003,"击杀特效·天雷",3,null,null,null,[21],0],[3004,"击杀特效·地刺",3,null,null,null,[22],0],[3005,"击杀特效·幻梦",3,null,null,null,[23],0],[3006,"击杀特效·炎爆",3,null,null,null,[45],0],[3007,"击杀特效·水龙卷",3,null,null,null,[46],0],[4001,"段位奖励·金丹",4,null,null,null,[28,35,40],0],[4002,"段位奖励·元婴",4,null,null,null,[29,36,41],0],[4003,"段位奖励·化神",4,null,null,null,[30,37,42],0],[4004,"段位奖励·炼虚",4,null,null,null,[31,38,43],0],[4005,"段位奖励·合体",4,null,null,null,[32,39,44],0]];
export interface IEquipElement extends IElementBase{
 	/**id和Shop表id保持一致*/
	id:number
	/**描述*/
	desc:string
	/**部位类型
1背部
2拖尾
3宠物
4变身挂件*/
	type:number
	/**属性枚举
固定加成值=================  
        移动速度  101
        血量加成102
        减伤 103
   近战攻击力 && 技能攻击力 104
       暴击率[0-100] 105
  增加伤害类道具效果 106
       最大能量  107
       生命偷取  108
怪物追击玩家速度 :(一个逻辑帧移动长度为x个单位的向量)109
   玩家经验加成110 
   暴击伤害  111 
   暴击抵抗 112 
   真实伤害 113 
百分比加成=================  
      移动速度  201
      血量加成 202
      减伤  203
   近战攻击力 && 技能攻击力   204
      暴击率[0-100] 205
   增加伤害类道具效果 206
      最大能量 207
      生命偷取 208
怪物追击玩家速度 :(一个逻辑帧移动长度为x个单位的向量)209
   玩家经验加成210 
     暴击伤害 211 
     暴击抵抗 212 
     真实伤害 213 
实际初始值=================== 
      移动速度  1
      最大生命值 2
      减伤  3
     近战攻击力 && 技能攻击力  4
      暴击率[0-100] 5
      增加伤害类道具效果  6 *(暂时没使用到)
      最大能量 7
      生命偷取 8
怪物追击玩家速度 :(一个逻辑帧移动长度为x个单位的向量)9：
玩家经验加成10    
     暴击伤害  11 
     暴击抵抗 12 
     真实伤害 13*/
	attrType:Array<number>
	/**属性值*/
	attrValue:Array<number>
	/**属性强化 倍率*/
	Magnification:Array<number>
	/**挂件id(统一管理就放到其他表了，后续相关属性设计可以放在这张表)*/
	pendantId:Array<number>
	/**是否有属性*/
	attrSwitch:number
 } 
export class EquipConfig extends ConfigBase<IEquipElement>{
	constructor(){
		super(EXCELDATA);
	}

}