import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","desc","guid","volume","loopCount","range"],["","","","","",""],[1,"虚空","19650",0.5,1,0],[2,"主岛","148621",0.5,1,0],[3,"遗迹岛屿","19650",0.5,1,0],[4,"腐败岛","19650",0.5,1,0],[5,"冰雪岛","19652",0.5,1,0],[6,"熔岩岛","19650",0.5,1,0],[7,"刀命中","73919",1,1,2000],[8,"技能命中","47418",1,1,2000],[9,"炼金成功音效","157460",1,1,0],[10,"炼金失败音效","120841",1,1,0],[11,"炼金期待音效","120843",1,1,0],[12,"云顶背景音乐","140368",0.3,1,0],[13,"秘境背景音乐","128884",0.3,1,0],[14,"七夕背景音","131608",0.8,1,0],[15,"参拜狗头佛祖音效","217406",1,1,3000],[16,"监控蛋仔拍照","134426",1,1,3000],[17,"拔萝卜","136202",1,1,3000],[18,"恐龙抗狼","169096",1,1,3000],[19,"小彗星刷新音效","122569",3,1,5000],[20,"只因哥音效","217829",1,2,3000],[21,"哦哈哟","217828",4,1,3000],[22,"上课铃声","217830",1.5,1,3000],[23,"我姓石喊麦","217978",3,1,3000],[24,"OI打招呼","218071",4,1,3000],[25,"流星背景音乐","218688",2,1,0],[26,"亡灵岛背景音","200445",0.6,0,0],[27,"运输船背景音","169120",0.9,0,0],[28,"糖果岛背景音","133480",1,0,0],[29,"太极岛","200523",1,0,0],[30,"天空之城","222919",1,0,0],[31,"乱斗战场音乐","106866",0,0,0],[32,"拾取音效","136202",1,1,0],[33,"下落到地面音效","130793",1,1,3000],[34,"乱斗安全区音乐","202119",0,0,0],[35,"双杀","237180",1,1,0],[36,"三杀","237178",1,1,0],[37,"统治战场","237179",1,1,0],[38,"超神","237177",1,1,0],[39,"单手剑命中","265138",1,1,3000]];
export interface ISoundElement extends IElementBase{
 	/**唯一id*/
	id:number
	/**描述*/
	desc:string
	/**音效guid*/
	guid:string
	/**音量*/
	volume:number
	/**循环次数（0为无限循环）*/
	loopCount:number
	/**音量范围
如果是3D音效才填*/
	range:number
 } 
export class SoundConfig extends ConfigBase<ISoundElement>{
	constructor(){
		super(EXCELDATA);
	}

}