import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","conflictID","buffName","note","duration","conflictTypes","guid","guidPosition","applyType","attackDamage","attackFixDamage","attackDamagePercent","findRange","findRangePercent","attackRange","attackTime","attackTimePercent","attackCount","speed","speedPercent","hurtAmount","hurtAmountPercent","armorPen","armorReduction","magicPen","magicReduction","flyingDamageBoost","healing","berserk","mother","children","warmUp","warmUpFindRange","warmUpAttackDamage","warmUpAttackTime","multiHit","flyFirst"],["","","Language","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],[1001,1001,null,null,0.2,1,"B0A6C67D4A3AE05B102976883590F4ED",null,1,-2,0,0,0.5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1002,1002,null,null,2,2,"B0A6C67D4A3AE05B102976883590F4ED",null,1,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1003,1003,null,null,3,1,null,null,1,0,0,0,0,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1004,1004,null,null,4,1,"FF3268BA438E7D17853D88A2A6C8FB89",null,2,0,0,0,0,0,0,0,0,0,0,-0.5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1005,1005,null,null,5,1,null,null,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1006,1006,null,"永久固定值加攻击力",-1,2,null,null,1,0.5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1007,1007,null,"永久百分比加攻击力",-1,2,null,null,1,2,0,200,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1008,1008,null,"减少固定值攻击间隔",-1,2,null,null,1,0,0,0,0,0,0,-0.01,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1009,1009,null,"永久百分比降低攻击间隔",-1,2,null,null,1,0,0,0,0,0,0,0,-20,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1010,1010,null,"怪物受到伤害百分比提升",-1,2,null,null,2,0,0,0,0,0,0,0,0,0,0,0,0,25,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1011,1011,null,"怪物减速",-1,2,null,null,2,0,0,0,0,0,0,0,0,0,-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1012,1012,null,"怪物永久百分比减速",-1,2,null,null,2,0,0,0,0,0,0,0,0,0,0,-60,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1013,1013,null,"永久固定加攻击范围",-1,1,null,null,1,0,0,0,0.02,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[1014,1014,null,"增加攻击范围百分比",-1,2,null,null,1,0,0,0,0,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[2001,2001,null,"永久百分比加攻击力1",2,1,"75E610CC445049E89172F4B7F387FAFB",[100,100,100],1,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[2002,2002,null,"永久百分比加攻击力2",2,1,"5813EE7E45E077985D984295FD40D837",[100,100,100],1,150,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[2003,2003,null,"永久百分比加攻击力3",2,1,"39CC680245A50F9AE8DBA09F16A0D43C",[100,100,100],1,250,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[3001,3001,"buffAirdrop_name1","空投Buff1",20,1,"39CC680245A50F9AE8DBA09F16A0D43C",null,1,0,0,2000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[3002,3002,"buffAirdrop_name2","空投Buff2",20,1,"39CC680245A50F9AE8DBA09F16A0D43C",null,1,0,0,0,0,2000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[3003,3003,"buffAirdrop_name3","空投Buff3",20,1,"39CC680245A50F9AE8DBA09F16A0D43C",null,1,0,0,0,0,0,0,0,-2000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4001,4001,null,"增伤",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4002,4002,null,"法穿",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30,0,0,0,0,0,0,0,0,0,0,0,0],[4003,4003,null,"物穿",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4004,4004,null,"削魔抗",3,1,null,null,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,100,0,0,0,0,0,0,0,0,0,0,0],[4005,4005,null,"削护甲",3,1,null,null,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,100,0,0,0,0,0,0,0,0,0,0,0,0,0],[4006,4006,null,"怪物减速",3,1,null,null,2,0,0,0,0,0,0,0,0,0,-30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4007,4007,null,"怪物禁锢",1,1,null,null,2,0,0,0,0,0,0,0,0,0,-999,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4008,4008,null,"对空增伤",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,20,0,0,0,0,0,0,0,0,0,0],[4009,4009,null,"暖机",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,60,1,250,0.2,0,0],[4010,4010,null,"多段伤害",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0],[4011,4011,null,"优先对空",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],[5001,5001,null,"复原力",-1,1,null,null,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40,0,0,0,0,0,0,0,0,0],[5002,5002,null,"狂暴化",-1,1,null,null,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0],[5003,5003,null,"母体",-1,1,null,null,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,1001,0,0,0,0,0,0],[4012,4012,null,"暗龙娘1法穿1",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,20,0,0,0,0,0,0,0,0,0,0,0,0],[4013,4013,null,"暗龙娘1法穿2",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30,0,0,0,0,0,0,0,0,0,0,0,0],[4014,4014,null,"暗龙娘1法穿3",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40,0,0,0,0,0,0,0,0,0,0,0,0],[4015,4015,null,"暗龙娘4物穿1",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4016,4016,null,"暗龙娘4物穿2",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4017,4017,null,"暗龙娘4物穿3",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4018,4018,null,"水龙娘2法穿3",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0],[4019,4019,null,"火龙娘眩晕",0.5,1,null,null,2,0,0,0,0,0,0,0,0,0,-999,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4020,4020,null,"火龙娘减速1",1,1,null,null,2,0,0,0,0,0,0,0,0,0,-10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4021,4021,null,"火龙娘减速2",1,1,null,null,2,0,0,0,0,0,0,0,0,0,-15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4022,4022,null,"火龙娘减速3",1,1,null,null,2,0,0,0,0,0,0,0,0,0,-20,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4023,4023,null,"光龙娘7 加攻击1",1,1,"3CE7059C48825B193B020AB8A6B343F7",[0,0,-80],1,0,150,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4024,4024,null,"光龙娘7 加攻击2",1,1,"EEF0C3154CA00BE152AADC857F1529F2",[0,0,-80],1,0,300,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4025,4025,null,"光龙娘7 加攻击3",1,1,"D65F557840A5173AE7E2BB90AC968ED1",[0,0,-80],1,0,450,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4026,4026,null,"暗龙娘6 加攻击1",1,1,"BB8356CD42A58A580145BE81B9AFC84F",[0,0,-80],1,0,0,0.3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4027,4027,null,"暗龙娘6 加攻击2",1,1,"6BE3DCD5418D112A087B60B768E2BACD",[0,0,-80],1,0,0,0.4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4028,4028,null,"暗龙娘6 加攻击3",1,1,"D9B71B3446E122C9DA22BFB4E4A9682B",[0,0,-80],1,0,0,0.5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4029,4029,null,"暗龙娘7 加攻击1",1,1,"E2CE74DB4FFC078249CD9FA34EA63629",[0,0,-80],1,0,0,0.8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4030,4030,null,"暗龙娘7 加攻击2",1,1,"037607A543F1B3F9EC372CBB11A8DAE7",[0,0,-80],1,0,0,0.9,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4031,4031,null,"暗龙娘7 加攻击3",1,1,"BE72907D4A0446FFCD4B89906E93BCE5",[0,0,-80],1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4032,4032,null,"火龙娘6 加攻击1",1,1,"C06F795645F3BAFC9F59DDB0FF3AA9BE",[0,0,-80],1,0,250,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4033,4033,null,"火龙娘6 加攻击2",1,1,"7C819332475B1A8AF77C58862D3CB55D",[0,0,-80],1,0,350,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4034,4034,null,"火龙娘6 加攻击3",1,1,"C309A3484345AA3160F4C980C980C16C",[0,0,-80],1,0,450,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4035,4035,null,"土龙娘6 加攻击1",1,1,"15FF5CCC42AC18D336C3A79E5ACA64EF",[0,0,-80],1,0,0,0.5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4036,4036,null,"土龙娘6 加攻击2",1,1,"798B49404BAB0165CF71F599343B75C9",[0,0,-80],1,0,0,0.6,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4037,4037,null,"土龙娘6 加攻击3",1,1,"BD23066F40380CC8169768ADD657662A",[0,0,-80],1,0,0,0.8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[4038,4038,null,"对空增伤",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,25,0,0,0,0,0,0,0,0,0,0],[4039,4039,null,"对空增伤",-1,1,null,null,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30,0,0,0,0,0,0,0,0,0,0]];
export interface IBuffElement extends IElementBase{
 	/**buff的id*/
	id:number
	/**冲突判断的ID
只有旗帜升级的buff不一样，其他的跟id一样*/
	conflictID:number
	/**buff名字*/
	buffName:string
	/**备注*/
	note:string
	/**buff持续时间
单位:秒
填 -1 无限*/
	duration:number
	/**buff冲突类型
1 = 覆盖
2 = 独立存在*/
	conflictTypes:number
	/**buff的Guid
可不填*/
	guid:string
	/**buff的Guid的相对位置*/
	guidPosition:Array<number>
	/**作用类型
1 = 塔
2 = 怪物*/
	applyType:number
	/**
    伤害数值*/
	attackDamage:number
	/**固定伤害数值提升*/
	attackFixDamage:number
	/**    伤害数值 百分比*/
	attackDamagePercent:number
	/**索敌范围*/
	findRange:number
	/**索敌范围百分比*/
	findRangePercent:number
	/**AOE范围*/
	attackRange:number
	/**攻击间隔时间*/
	attackTime:number
	/**攻击间隔时间百分比*/
	attackTimePercent:number
	/**攻击目标数*/
	attackCount:number
	/**移动速度（-999为禁锢）*/
	speed:number
	/**移速降低buff*/
	speedPercent:number
	/**给怪增伤*/
	hurtAmount:number
	/**受伤提升buff*/
	hurtAmountPercent:number
	/**自身穿甲*/
	armorPen:number
	/**削甲*/
	armorReduction:number
	/**法穿*/
	magicPen:number
	/**削魔抗*/
	magicReduction:number
	/**对飞行怪物增伤*/
	flyingDamageBoost:number
	/**每秒回血量*/
	healing:number
	/**移动速度X倍*/
	berserk:number
	/**是否是母体
0 不是
其他是，并且分裂出来的数量*/
	mother:number
	/**分裂出来的小怪*/
	children:number
	/**暖机时间（s）*/
	warmUp:number
	/**暖机后的提升攻击范围
最终攻击范围=原范围+提升范围*/
	warmUpFindRange:number
	/**暖机后的提升攻击力
最终攻击力=原攻击力+提升攻击力*/
	warmUpAttackDamage:number
	/**暖机后的提升攻速
最终攻速=原攻速-提升攻速*/
	warmUpAttackTime:number
	/**多段伤害
触发的次数*/
	multiHit:number
	/**优先对空
0 没有
1 有*/
	flyFirst:number
 } 
export class BuffConfig extends ConfigBase<IBuffElement>{
	constructor(){
		super(EXCELDATA);
	}

}