import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","types","name","nameCN","elementTy","guid","walkAnim","hp","speed","underattack","attackproportion","goldAmount","escapeDamage","buffSlot","buffSlotRelativePos","hurtAnim","hurtAnimDur","deadAnim","deadAnimDur","vertigoDelay","armor","magicResist","buff"],["","","Language","","","","","","","","","","","","","","","","","","","",""],[1001,null,"Monster_name_1","丧尸",1,"268048","268567",550,105,"107535",1,5,25,23,new mw.Vector(0,0,150),"97861",0.3,"285139",1.5,3,200,200,[5002]],[1002,[1],"Monster_name_2","快速丧尸",2,"174947","122498",40,200,"107535",1,5,25,23,new mw.Vector(0,0,150),"97861",0.3,"285139",1.5,3,200,200,null],[1003,[5],"Monster_name_3","僵尸",3,"146185","122549",500,75,"107535",1,100,500,23,new mw.Vector(0,0,150),null,0.3,"20291",1,3,200,200,null],[1004,[2],"Monster_name_4","飞行",4,"151835","164988",30,150,"107535",1,5,25,23,new mw.Vector(0,0,150),"145952",0.3,"285395",1,3,200,200,null],[1005,[3],"Monster_name_5","护士",5,"174911","97860",40,150,"107535",1,5,25,23,new mw.Vector(0,0,150),"97861",0.3,"285139",1.5,3,200,200,null],[1006,[5],"Monster_name_6","铁钩怪人",6,"145900","122498",500,75,"107535",1,100,500,23,new mw.Vector(0,0,150),"97861",0.3,"285139",1.5,3,200,200,null],[1007,null,"Monster_name_1","龙娘测试",6,"268048","268567",50,50,"107535",1,5,20,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,3,200,200,null],[1008,null,"Monster_name_7","黑木乃伊",2,"156486","268562",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,3,10,10,null],[1009,null,"Monster_name_8","羊角怪",2,"157055","122498",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,3,10,10,null],[1010,null,"Monster_name_9","飞行羊角怪",2,"183662","285174",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,3,10,10,null],[1011,null,"Monster_name_10","暗战士",2,"156842","281015",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,3,10,10,null],[1012,null,"Monster_name_11","暗首领",2,"157127","269143",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,3,10,10,null],[1013,null,"Monster_name_12","蛇女",2,"311953","318617",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,3,10,10,null],[1014,null,"Monster_name_13","憎恶",2,"192626","285336",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1015,null,"Monster_name_14","蓝恶魔",3,"195139","268512",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1016,null,"Monster_name_15","玄冰战士",3,"155187","284926",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1017,null,"Monster_name_16","玄冰守卫",3,"156952","268725",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1018,null,"Monster_name_17","玄冰巫师",3,"156959","280699",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1019,null,"Monster_name_18","雪怪",3,"194484","268562",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1020,null,"Monster_name_19","南瓜小怪",5,"151885","268512",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1021,null,"Monster_name_20","鹿角怪",5,"156764","284926",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1022,null,"Monster_name_21","荆棘之兴",5,"156809","268567",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1023,null,"Monster_name_22","老树人",5,"157271","285336",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1024,null,"Monster_name_23","女树人",5,"155742","268512",200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1025,null,"Monster_name_24","熔岩小怪",4,"151835",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1026,null,"Monster_name_25","熔岩巨兽",4,"192832",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1027,null,"Monster_name_26","火焰小兵",4,"192643",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1028,null,"Monster_name_27","火恶魔",4,"311954",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1029,null,"Monster_name_28","熔岩铁甲",4,"195287",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1030,null,"Monster_name_29","草地小怪",6,"151886",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1031,null,"Monster_name_30","石头怪",6,"180478",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1032,null,"Monster_name_31","屠夫",6,"179413",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1033,null,"Monster_name_32","老年地精",6,"142306",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1034,null,"Monster_name_33","青年地精",6,"142300",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1035,null,"Monster_name_34","木乃伊",1,"151157",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1036,null,"Monster_name_35","光巨人",1,"196958",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1037,null,"Monster_name_36","机甲战士",1,"142396",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1038,null,"Monster_name_37","光战士",1,"137844",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null],[1039,null,"Monster_name_38","未来战士",1,"142153",null,200,105,"107535",1,10,1,23,new mw.Vector(0,0,150),"97861",0.3,"281693",1.5,0,0,0,null]];
export interface IMonsterElement extends IElementBase{
 	/**怪物id*/
	id:number
	/**怪物类型 (1： 隐身，2：飞行，3：装甲，4：免控，5：boss)*/
	types:Array<number>
	/**名字*/
	name:string
	/**名字备注*/
	nameCN:string
	/**元素类型（1——6对应光暗水火木土）*/
	elementTy:number
	/**换装guid*/
	guid:string
	/**行走动画*/
	walkAnim:string
	/**生命值*/
	hp:number
	/**行走速度*/
	speed:number
	/**受击特效*/
	underattack:string
	/**受击特效缩放比例*/
	attackproportion:number
	/**击杀金币*/
	goldAmount:number
	/**逃跑伤害*/
	escapeDamage:number
	/**buff挂点*/
	buffSlot:number
	/**buff挂点偏移*/
	buffSlotRelativePos:mw.Vector
	/**受击动画*/
	hurtAnim:string
	/**受击动画持续时间*/
	hurtAnimDur:number
	/**死亡动画*/
	deadAnim:string
	/**死亡动画持续时间*/
	deadAnimDur:number
	/**眩晕后的内置CD（从怪物受到眩晕buff时，应用该列计时，时间内怪物不会再次受到眩晕buff影响）*/
	vertigoDelay:number
	/**初始护甲*/
	armor:number
	/**初始魔抗*/
	magicResist:number
	/**怪物的Buff*/
	buff:Array<number>
 } 
export class MonsterConfig extends ConfigBase<IMonsterElement>{
	constructor(){
		super(EXCELDATA);
	}

}