import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","index","guid","slotMaterials","stagePosition","stageName","NameCN","stageImageGuid","recommandedLevel","difficultyhp","firstRewardPerfect","followRewardPerfect","firstRewardNormal","followRewardNormal","failReward"],["","","","","","Language","","","","","","","","",""],[1,99,"4489848440A02ABB1B11F8AE067715EA",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,30000),"引导",null,"267079",1,1,[[2001,1],[1,250],[3,10]],[[2001,1],[1,250],[3,10]],[[2001,1],[1,250],[3,10]],[[2001,1],[1,250],[3,10]],[[2001,1],[1,250],[3,10]]],[1001,0,"4489848440A02ABB1B11F8AE067715EA",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,30000),"Stage_stageName_1","世界1-简单","267079",1,1,[[1002,1],[1,200],[3,12]],[[1,100],[3,12]],[[1002,1],[1,150],[3,12]],[[1,50],[3,10]],[[1,25],[3,10]]],[1002,0,"4489848440A02ABB1B11F8AE067715EA",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,30000),"Stage_stageName_2","世界1-普通","267079",5,2,[[1,240],[2,240],[3,24]],[[1,192],[2,192],[3,19]],[[1,120],[2,120],[3,12]],[[1,96],[2,96],[3,10]],[[1,30],[2,30],[3,3]]],[1003,0,"4489848440A02ABB1B11F8AE067715EA",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,30000),"Stage_stageName_3","世界1-困难","267079",10,3,[[1,330],[2,330],[3,33]],[[1,264],[2,264],[3,26]],[[1,165],[2,165],[3,17]],[[1,132],[2,132],[3,14]],[[1,40],[2,40],[3,4]]],[2001,1,"22C5750F4CDFF4363A3C3E9C5B5E9EE8",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,40000),"Stage_stageName_4","世界2-简单","267204",3,1,[[1,180],[2,180],[3,18]],[[1,144],[2,144],[3,14]],[[1,105],[2,105],[3,10]],[[1,84],[2,84],[3,8]],[[1,25],[2,25],[3,5]]],[2002,1,"22C5750F4CDFF4363A3C3E9C5B5E9EE8",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,40000),"Stage_stageName_5","世界2-普通","267204",7,2,[[1,270],[2,270],[3,27]],[[1,216],[2,216],[3,22]],[[1,120],[2,120],[3,12]],[[1,96],[2,96],[3,10]],[[1,30],[2,30],[3,5]]],[2003,1,"22C5750F4CDFF4363A3C3E9C5B5E9EE8",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,40000),"Stage_stageName_6","世界2-困难","267204",13,3,[[1,360],[2,360],[3,36]],[[1,288],[2,288],[3,29]],[[1,180],[2,180],[3,18]],[[1,144],[2,144],[3,14]],[[1,45],[2,45],[3,6]]],[3001,2,"BFBB6BDD4D1D246C9B021F99C2E6B368",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,50000),"Stage_stageName_7","世界3-简单","267212",5,1,[[1,210],[2,210],[3,21]],[[1,168],[2,168],[3,17]],[[1,120],[2,120],[3,12]],[[1,96],[2,96],[3,10]],[[1,30],[2,30],[3,7]]],[3002,2,"BFBB6BDD4D1D246C9B021F99C2E6B368",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,50000),"Stage_stageName_8","世界3-普通","267212",9,2,[[1,300],[2,300],[3,30]],[[1,240],[2,240],[3,24]],[[1,150],[2,150],[3,15]],[[1,120],[2,120],[3,12]],[[1,35],[2,35],[3,8]]],[3003,2,"BFBB6BDD4D1D246C9B021F99C2E6B368",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,50000),"Stage_stageName_9","世界3-困难","267212",15,3,[[1,390],[2,390],[3,39]],[[1,312],[2,312],[3,31]],[[1,195],[2,195],[3,20]],[[1,156],[2,156],[3,16]],[[1,45],[2,45],[3,9]]],[4001,3,"01BFBD824DAD4195BB656182F8683C83",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,60000),"Stage_stageName_10","世界4-简单","286353",15,1,[[1,210],[2,210],[3,21]],[[1,168],[2,168],[3,17]],[[1,120],[2,120],[3,12]],[[1,96],[2,96],[3,10]],[[1,30],[2,30],[3,7]]],[4002,3,"01BFBD824DAD4195BB656182F8683C83",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,60000),"Stage_stageName_11","世界4-普通","286353",17,2,[[1,300],[2,300],[3,30]],[[1,240],[2,240],[3,24]],[[1,150],[2,150],[3,15]],[[1,120],[2,120],[3,12]],[[1,35],[2,35],[3,8]]],[4003,3,"01BFBD824DAD4195BB656182F8683C83",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,60000),"Stage_stageName_12","世界4-困难","286353",19,3,[[1,390],[2,390],[3,39]],[[1,312],[2,312],[3,31]],[[1,195],[2,195],[3,20]],[[1,156],[2,156],[3,16]],[[1,45],[2,45],[3,9]]],[5001,4,"836427244F85AC34DE722C82E976607A",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,70000),"Stage_stageName_13","世界5-简单","286352",21,1,[[1,210],[2,210],[3,21]],[[1,168],[2,168],[3,17]],[[1,120],[2,120],[3,12]],[[1,96],[2,96],[3,10]],[[1,30],[2,30],[3,7]]],[5002,4,"836427244F85AC34DE722C82E976607A",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,70000),"Stage_stageName_14","世界5-普通","286352",23,2,[[1,300],[2,300],[3,30]],[[1,240],[2,240],[3,24]],[[1,150],[2,150],[3,15]],[[1,120],[2,120],[3,12]],[[1,35],[2,35],[3,8]]],[5003,4,"836427244F85AC34DE722C82E976607A",["0143A94E4F41C44CCE3F2CA73F433DEA","2C47B8A848AA497877FCCFAC8097DD15"],new mw.Vector(0,0,70000),"Stage_stageName_15","世界5-困难","286352",25,3,[[1,390],[2,390],[3,39]],[[1,312],[2,312],[3,31]],[[1,195],[2,195],[3,20]],[[1,156],[2,156],[3,16]],[[1,45],[2,45],[3,9]]]];
export interface IStageElement extends IElementBase{
 	/**关卡id*/
	id:number
	/**索引*/
	index:number
	/**预制体guid*/
	guid:string
	/**放置区域材质*/
	slotMaterials:Array<string>
	/**关卡位置*/
	stagePosition:mw.Vector
	/**关卡名字*/
	stageName:string
	/**关卡名备注*/
	NameCN:string
	/**关卡图*/
	stageImageGuid:string
	/**推荐等级*/
	recommandedLevel:number
	/**难度怪物血量倍数*/
	difficultyhp:number
	/**首次完美通关奖励，关联道具表*/
	firstRewardPerfect:Array<Array<number>>
	/**后续通关完美奖励*/
	followRewardPerfect:Array<Array<number>>
	/**首次通关奖励*/
	firstRewardNormal:Array<Array<number>>
	/**后续通关奖励*/
	followRewardNormal:Array<Array<number>>
	/**失败奖励*/
	failReward:Array<Array<number>>
 } 
export class StageConfig extends ConfigBase<IStageElement>{
	constructor(){
		super(EXCELDATA);
	}

}