import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","name","nameCN","type","value","valueType","descCN"],["","","","","","",""],[1001,"TalentTree_Name_1","物理基础",1,[2,4],2,"物理伤害提高{0}%"],[1002,"TalentTree_Name_2","魔法学识",1,[2,4],2,"魔法伤害提高{0}%"],[1003,"TalentTree_Name_3","基地耐久",1,[100,200,300],1,"基地耐久提高{0}"],[1004,"TalentTree_Name_4","攻速增强",1,[2,4,6],2,"攻击速度提高{0}%"],[1005,"TalentTree_Name_5","天降能量",1,[10,20],1,"每个波次获得{0}能量"],[1006,"TalentTree_Name_6","矿机升级",1,[8,16,24,32,40],1,"能量单位产出能量效率提高{0}%"],[1007,"TalentTree_Name_7","光元素增伤",1,[2,4],2,"光属性伤害提高{0}%"],[1008,"TalentTree_Name_8","水元素增伤",1,[2,4],2,"水属性伤害提高{0}%"],[1009,"TalentTree_Name_9","土元素增伤",1,[2,4],2,"土属性伤害提高{0}%"],[1010,"TalentTree_Name_10","耐久恢复",1,[50,100],1,"基地每个波次恢复{0}耐久"],[1011,"TalentTree_Name_11","暗元素增伤",1,[2,4],2,"暗属性伤害提高{0}%"],[1012,"TalentTree_Name_12","火元素增伤",1,[2,4],2,"火属性伤害提高{0}%"],[1013,"TalentTree_Name_13","木元素增伤",1,[2,4],2,"木属性伤害提高{0}%"],[1014,"TalentTree_Name_14","敌方减速",1,[1,2,3],2,"敌方入场10秒内减速{0}%"],[1015,"TalentTree_Name_15","慧光",1,[1,2,3,4],2,"敌方受到伤害提高{0}%"],[1016,"TalentTree_Name_16","距离增强",1,[5,10],2,"攻击范围提高{0}%"],[1017,"TalentTree_Name_17","物理斩杀",1,[20],2,"物理伤害对于血量低于20%的敌方造成伤害提高{0}%"],[1018,"TalentTree_Name_18","黯灭",1,[10,20,30,40],1,"敌方入场10秒内护甲减少{0}"],[1019,"TalentTree_Name_19","希瓦",1,[10,20,30,40],1,"敌方入场10秒内魔抗减少{0}"],[1020,"TalentTree_Name_20","高射火炮",1,[2,4],2,"对空中敌方造成伤害提高{0}%"],[1021,"TalentTree_Name_21","魔法压制",1,[20],2,"魔法伤害对于血量高于80%的敌方造成伤害提高{0}%"],[1022,"TalentTree_Name_22","元素压制",1,[10,20,30],2,"元素克制时造成伤害提高{0}%"],[1023,"TalentTree_Name_23","元素抵抗",1,[10,20,30],2,"元素被克制时的伤害减免减少{0}%"],[1024,"TalentTree_Name_24","慧光2",1,[1,2,3,4],2,"敌方受到伤害提高{0}%"],[1025,"TalentTree_Name_25","物理精通",1,[2,4,6],2,"物理伤害提高{0}%"],[1026,"TalentTree_Name_26","魔法升华",1,[2,4,6],2,"魔法伤害提高{0}%"],[1027,"TalentTree_Name_27","基地耐久2",1,[100,200,300],1,"基地耐久提高{0}"],[1028,"TalentTree_Name_28","攻速增强2",1,[2,4,6],2,"攻击速度提高{0}%"],[1029,"TalentTree_Name_29","天降能量2",1,[10,20],1,"每个波次获得{0}能量"],[1030,"TalentTree_Name_30","矿机升级2",1,[8,16,24,32,40],1,"能量单位产出能量效率提高{0}%"],[1031,"TalentTree_Name_31","光·Ⅱ",1,[2,4],2,"光属性伤害提高{0}%"],[1032,"TalentTree_Name_32","水·Ⅱ",1,[2,4],2,"水属性伤害提高{0}%"],[1033,"TalentTree_Name_33","土·Ⅱ",1,[2,4],2,"土属性伤害提高{0}%"],[1034,"TalentTree_Name_34","耐久恢复Ⅱ",1,[50,100],1,"基地每个波次恢复{0}耐久"],[1035,"TalentTree_Name_35","暗·Ⅱ",1,[2,4],2,"暗属性伤害提高{0}%"],[1036,"TalentTree_Name_36","火·Ⅱ",1,[2,4],2,"火属性伤害提高{0}%"],[1037,"TalentTree_Name_37","木·Ⅱ",1,[2,4],2,"木属性伤害提高{0}%"],[1038,"TalentTree_Name_38","敌方减速2",1,[1,2,3],2,"敌方入场10秒内减速{0}%"],[1039,"TalentTree_Name_39","慧光3",1,[1,2,3,4],2,"敌方受到伤害提高{0}%"],[1040,"TalentTree_Name_40","距离增强2",1,[5,10],2,"攻击范围提高{0}%"],[1041,"TalentTree_Name_41","物理斩杀2",1,[20],2,"物理伤害对于血量低于20%的敌方造成伤害提高{0}%"],[1042,"TalentTree_Name_42","黯灭2",1,[10,20,30,40],1,"敌方入场10秒内护甲减少{0}"],[1043,"TalentTree_Name_43","希瓦2",1,[10,20,30,40],1,"敌方入场10秒内魔抗减少{0}"],[1044,"TalentTree_Name_44","高射火炮2",1,[2,4],2,"对空中敌方造成伤害提高{0}%"],[1045,"TalentTree_Name_45","魔法压制2",1,[20],2,"魔法伤害对于血量高于80%的敌方造成伤害提高{0}%"],[1046,"TalentTree_Name_46","慧光4",1,[1,2,3,4],2,"敌方受到伤害提高{0}%"],[1047,"TalentTree_Name_47","物理",2,[2],2,"在无尽模式下，物理伤害提高{0}%"],[1048,"TalentTree_Name_48","魔法",2,[2],2,"在无尽模式下，魔法伤害提高{0}%"],[1049,"TalentTree_Name_49","耐久",2,[100],1,"在无尽模式下，基地耐久提高{0}"],[2001,"TalentBuff_Name_2001","物理（龙娘祝福）",1,[2,4,6],2,"物理伤害提高{0}%"],[2002,"TalentBuff_Name_2002","魔法（龙娘祝福）",1,[2,4,6],2,"魔法伤害提高{0}%"],[2003,"TalentBuff_Name_2003"," 攻击距离（龙娘祝福）",1,[5,10,15],2,"攻击范围提高{0}%"],[2004,"TalentBuff_Name_2004","减速 (龙娘祝福）",1,[1,2,3],2,"敌方入场5秒内减速{0}%"],[2005,"TalentBuff_Name_2005","基地血量 (龙娘祝福）",1,[100,200,300],1,"基地耐久提高{0}"],[2006,"TalentBuff_Name_2006","攻击速度 (龙娘祝福）",1,[2,4,6],2,"攻击速度提高{0}%"]];
export interface ITalentBuffElement extends IElementBase{
 	/**Buffid*/
	id:number
	/**Buff名称*/
	name:string
	/**Buff名称(备注)*/
	nameCN:string
	/**Buff类型*/
	type:number
	/**1:基础类型*/
	value:Array<number>
	/**2:巅峰天赋*/
	valueType:number
	/**天赋Buff数值*/
	descCN:string
 } 
export class TalentBuffConfig extends ConfigBase<ITalentBuffElement>{
	constructor(){
		super(EXCELDATA);
	}

}