import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","taskName","taskInfo","taskCN","taskType","preconditions","rewards","taskSolveType","taskSolvetime"],["tag","Language","Language","","","","","",""],[100001,"Task_taskName_1","Task_taskinfo_1","通关世界1·困难",1,null,[[1,300],[2,100],[3,10]],1,2],[100002,"Task_taskName_2","Task_taskinfo_2","通关世界2·困难",1,null,[[1,500],[2,100],[3,10]],1,12],[100003,"Task_taskName_3","Task_taskinfo_3","通关世界3·困难",1,null,[[1,600],[2,150],[3,10]],1,22],[100004,"Task_taskName_4","Task_taskinfo_4","通关世界4·困难",1,null,[[1,1000],[2,200],[3,10]],1,32],[100005,"Task_taskName_5","Task_taskinfo_5","通关世界5·困难",1,null,[[1,2500],[2,600],[3,10]],1,42],[100006,"Task_taskName_6","Task_taskinfo_6","完美通关世界1·困难",1,null,[[1,600],[2,100],[3,15]],7,2],[100007,"Task_taskName_7","Task_taskinfo_7","完美通关世界2·困难",1,null,[[1,700],[2,150],[3,15]],7,12],[100008,"Task_taskName_8","Task_taskinfo_8","完美通关世界3·困难",1,null,[[1,1000],[2,200],[3,15]],7,22],[100009,"Task_taskName_9","Task_taskinfo_9","完美通关世界4·困难",1,null,[[1,1500],[2,250],[3,15]],7,32],[100010,"Task_taskName_10","Task_taskinfo_10","完美通关世界5·困难",1,null,[[1,3500],[2,900],[3,15]],7,42],[100011,"Task_taskName_11","Task_taskinfo_11","解锁天赋·慧光",1,null,[[1,100],[2,100],[3,10]],2,1015],[100012,"Task_taskName_12","Task_taskinfo_12","解锁天赋·慧光2",1,null,[[1,100],[2,100],[3,10]],2,1024],[100013,"Task_taskName_13","Task_taskinfo_13","解锁天赋·慧光3",1,null,[[1,100],[2,100],[3,10]],2,1039],[100014,"Task_taskName_14","Task_taskinfo_14","解锁天赋·慧光4",1,null,[[1,100],[2,100],[3,10]],2,1046],[100015,"Task_taskName_15","Task_taskinfo_15","无尽天赋·物理 升至10级",1,null,[[1,300],[2,100],[3,10]],1047,10],[100016,"Task_taskName_16","Task_taskinfo_16","无尽天赋·魔法 升至10级",1,null,[[1,300],[2,100],[3,10]],1048,10],[100017,"Task_taskName_17","Task_taskinfo_17","无尽天赋·耐久 升至10级",1,null,[[1,300],[2,100],[3,10]],1049,10],[100018,"Task_taskName_18","Task_taskinfo_18","累计解锁天赋60点",1,null,[[1,300],[2,100],[3,10]],26,60],[100019,"Task_taskName_19","Task_taskinfo_19","累计解锁天赋120点",1,null,[[1,300],[2,200],[3,10]],26,120],[100020,"Task_taskName_20","Task_taskinfo_20","累计解锁天赋150点",1,null,[[1,300],[2,300],[3,10]],26,150],[100021,"Task_taskName_21","Task_taskinfo_21","解锁塔38个",1,null,[[1,2000],[2,600],[3,10]],3,38],[100022,"Task_taskName_22","Task_taskinfo_22","累计游戏100次",1,null,[[1,400],[2,200],[3,50]],5,100],[100023,"Task_taskName_23","Task_taskinfo_23","累计游戏200次",1,null,[[1,800],[2,400],[3,100]],5,300],[100024,"Task_taskName_24","Task_taskinfo_24","累计完美通关20次",1,null,[[1,300],[2,200],[3,20]],8,20],[100025,"Task_taskName_25","Task_taskinfo_25","累计完美通关50次",1,null,[[1,600],[2,400],[3,50]],8,50],[100026,"Task_taskName_26","Task_taskinfo_26","累计击败怪物1000个",1,null,[[1,400],[2,100],[3,50]],6,5000],[100027,"Task_taskName_27","Task_taskinfo_27","累计击败怪物2000个",1,null,[[1,800],[2,200],[3,50]],6,20000],[100028,"Task_taskName_28","Task_taskinfo_28","累计击败怪物5000个",1,null,[[1,1000],[2,300],[3,50]],6,50000],[100029,"Task_taskName_29","Task_taskinfo_29","累计击败怪物10000个",1,null,[[1,2500],[2,400],[3,50]],6,100000],[100030,"Task_taskName_30","Task_taskinfo_30","累计部署光元素塔500次",1,null,[[1,400],[2,200],[3,20]],9,1000],[100031,"Task_taskName_31","Task_taskinfo_31","累计部署光元素塔1000次",1,null,[[1,800],[2,400],[3,20]],9,2000],[100032,"Task_taskName_32","Task_taskinfo_32","累计部署暗元素塔500次",1,null,[[1,400],[2,200],[3,20]],10,1000],[100033,"Task_taskName_33","Task_taskinfo_33","累计部署暗元素塔1000次",1,null,[[1,800],[2,400],[3,20]],10,2000],[100034,"Task_taskName_34","Task_taskinfo_34","累计部署水元素塔500次",1,null,[[1,400],[2,200],[3,20]],11,1000],[100035,"Task_taskName_35","Task_taskinfo_35","累计部署水元素塔1000次",1,null,[[1,800],[2,400],[3,20]],11,2000],[100036,"Task_taskName_36","Task_taskinfo_36","累计部署火元素塔500次",1,null,[[1,400],[2,200],[3,20]],12,1000],[100037,"Task_taskName_37","Task_taskinfo_37","累计部署火元素塔1000次",1,null,[[1,800],[2,400],[3,20]],12,2000],[100038,"Task_taskName_38","Task_taskinfo_38","累计部署木元素塔500次",1,null,[[1,400],[2,200],[3,20]],13,1000],[100039,"Task_taskName_39","Task_taskinfo_39","累计部署木元素塔1000次",1,null,[[1,800],[2,400],[3,20]],13,2000],[100040,"Task_taskName_40","Task_taskinfo_40","累计部署土元素塔500次",1,null,[[1,400],[2,200],[3,20]],14,1000],[100041,"Task_taskName_41","Task_taskinfo_41","累计部署土元素塔1000次",1,null,[[1,800],[2,400],[3,20]],14,2000],[100042,"Task_taskName_42","Task_taskinfo_42","角色等级到达18级",1,null,[[1,800],[2,400]],15,18],[100043,"Task_taskName_43","Task_taskinfo_43","角色等级到达30级",1,null,[[1,1000],[2,600]],15,30],[100044,"Task_taskName_44","Task_taskinfo_44","角色等级到达50级",1,null,[[1,1500],[2,800]],15,50],[100045,"Task_taskName_45","Task_taskinfo_45","无尽关卡成功抵御10波",1,null,[[1,400],[2,200]],16,50],[100046,"Task_taskName_46","Task_taskinfo_46","无尽关卡成功抵御30波",1,null,[[1,400],[2,200]],16,70],[100047,"Task_taskName_47","Task_taskinfo_47","无尽关卡成功抵御50波",1,null,[[1,400],[2,200]],16,100],[100048,"Task_taskName_48","Task_taskinfo_48","无尽关卡成功抵御100波",1,null,[[1,400],[2,200]],16,150],[100049,"Task_taskName_49","Task_taskinfo_49","累计强化3级塔500次",1,null,[[1,400],[2,200],[3,20]],17,500],[100050,"Task_taskName_50","Task_taskinfo_50","累计强化3级塔1000次",1,null,[[1,800],[2,400],[3,20]],17,1000],[100051,"Task_taskName_51","Task_taskinfo_51","累计击败复原力怪物2000只",1,null,[[1,400],[2,100],[3,20]],18,2000],[100052,"Task_taskName_52","Task_taskinfo_52","累计击败狂暴怪物2000只",1,null,[[1,400],[2,100],[3,20]],19,2000],[100053,"Task_taskName_53","Task_taskinfo_53","累计击败隐身怪物2000只",1,null,[[1,400],[2,100],[3,20]],21,2000],[100054,"Task_taskName_54","Task_taskinfo_54","累计击败飞行怪物2000只",1,null,[[1,400],[2,100],[3,20]],20,2000],[100055,"Task_taskName_55","Task_taskinfo_55","今日游戏10次",2,[1],[[1,200],[2,120],[3,10]],5,10],[100056,"Task_taskName_56","Task_taskinfo_56","今日完美通关10次",2,[1],[[1,500],[2,500],[3,10]],8,10],[100057,"Task_taskName_57","Task_taskinfo_57","今日挑战无尽关卡3次",2,[1],[[1,300],[2,70],[3,10]],22,3],[100058,"Task_taskName_58","Task_taskinfo_58","今日击败怪物300个",2,[1],[[1,300],[2,70],[3,10]],6,300],[100059,"Task_taskName_59","Task_taskinfo_59","今日击败无尽关卡首领3个",2,[1],[[1,300],[2,70],[3,10]],23,3],[100060,"Task_taskName_60","Task_taskinfo_60","今日部署光元素塔200次",2,[1],[[1,100],[2,70],[3,10]],9,200],[100061,"Task_taskName_61","Task_taskinfo_61","今日部署暗元素塔200次",2,[1],[[1,100],[2,70],[3,10]],10,200],[100062,"Task_taskName_62","Task_taskinfo_62","今日部署水元素塔200次",2,[1],[[1,100],[2,70],[3,10]],11,200],[100063,"Task_taskName_63","Task_taskinfo_63","今日部署火元素塔200次",2,[1],[[1,100],[2,70],[3,10]],12,200],[100064,"Task_taskName_64","Task_taskinfo_64","今日部署木元素塔200次",2,[1],[[1,100],[2,70],[3,10]],13,200],[100065,"Task_taskName_65","Task_taskinfo_65","今日部署土元素塔200次",2,[1],[[1,100],[2,70],[3,10]],14,200],[100066,"Task_taskName_66","Task_taskinfo_66","今日强化3级塔100次",2,[1],[[1,100],[2,70],[3,10]],17,100],[100067,"Task_taskName_67","Task_taskinfo_67","今日击败复原力怪物200只",2,[1],[[1,100],[2,70],[3,10]],18,200],[100068,"Task_taskName_68","Task_taskinfo_68","今日击败狂暴怪物200只",2,[1],[[1,100],[2,70],[3,10]],19,200],[100069,"Task_taskName_69","Task_taskinfo_69","今日击败隐身怪物200只",2,[1],[[1,100],[2,70],[3,10]],21,200],[100070,"Task_taskName_70","Task_taskinfo_70","今日击败飞行怪物200只",2,[1],[[1,100],[2,70],[3,10]],20,200],[100071,"Task_taskName_71","Task_taskinfo_71","今日角色完成一次升级",2,[1],[[1,200],[2,70],[3,10]],15,1],[100072,"Task_taskName_72","Task_taskinfo_72","今日解锁一点天赋",2,[1],[[3,20]],2,1],[100073,"Task_taskName_73","Task_taskinfo_73","今日解锁一个塔",2,[1],[[2,70],[3,10]],25,1]];
export interface ITaskElement extends IElementBase{
 	/**id*/
	id:number
	/**任务名称*/
	taskName:string
	/**任务描述*/
	taskInfo:string
	/**任务描述备注*/
	taskCN:string
	/**任务类型
1 主线 
2 日常*/
	taskType:number
	/**前置任务
第一列的id
每日任务跟等级挂钩*/
	preconditions:Array<number>
	/**任务奖励*/
	rewards:Array<Array<number>>
	/**任务类型
1.通过某关卡id
2.解锁科技树某id科技
3.解锁多少个塔
4.副本获得多少星星
5.游玩几局游戏
6.击败多少只怪物
7.完美通过某个关卡
8.完美游玩次数
9.部署光塔次数
10.部署暗塔次数
11.部署水塔次数
12.部署火塔次数
13.部署木塔次数
14.部署土塔次数
15.玩家级数
16.无尽模式的波次（只支持主线）
17.升级lv3 次数
18.击败多少只复原力怪物
19.击败多少只狂暴怪物
20.击败多少只飞行怪物
21.击败多少只隐身怪物
22.挑战无尽关卡的次数
23.无尽关卡的boss击杀次数
24.升级防御塔的次数
25.日常解锁一次塔（只支持日常）
26.累计天赋解锁
1047.终极天赋物理
1048.终极天赋魔法
1049.终极天赋耐久*/
	taskSolveType:number
	/**任务需要的量*/
	taskSolvetime:number
 } 
export class TaskConfig extends ConfigBase<ITaskElement>{
	constructor(){
		super(EXCELDATA);
	}

}