import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","Name","Guid","Volume","Distance","IsBgm","LoopCount","isLoop","Comment"],["","","","","","","","",""],[1001,"喘气","134419",0.8,0,false,1,false,"不论器材2次交互动作（即，获得2次数值）后，第3次播放交互动作时播放1次音效，不强制停止，音效正常播完"],[1002,"光环buff","95728",0.8,0,false,1,false,"每次触发健身光环时播放1次音效，不强制停止，音效正常播完"],[1003,"跑步机-机器音","14920",0.6,0,false,1,true,"进入交互状态时循环播放机器音效，离开交互状态时，停止器材音效"],[1004,"跑步机-跑步音","196558",0.8,0,false,1,false,"触发交互动画时播放音效，停止交互动画时，停止音效（每播放1次交互动画播放1次）"],[1005,"卧推","27489",0.8,0,false,1,false,"触发交互动画时播放音效，停止交互动画时，停止音效（每播放1次交互动画播放1次）"],[1006,"开合跳","27202",0.8,0,false,1,false,"触发交互动画时播放音效，停止交互动画时，停止音效（每播放1次交互动画播放1次）"],[1007,"划船机","155808",0.8,0,false,1,false,"触发交互动画时播放音效，停止交互动画时，停止音效（每播放1次交互动画播放1次）"],[1008,"踢击","73918",0.8,0,false,1,false,"触发交互动画时播放音效，停止交互动画时，停止音效（每播放1次交互动画播放1次）"],[1009,"打沙包","125376",0.8,0,false,1,false,"触发交互动画时播放音效，停止交互动画时，停止音效（每播放1次交互动画播放1次）"],[1010,"托马斯回旋","27202",0.8,0,false,1,false,"触发交互动画时播放音效，停止交互动画时，停止音效（每播放1次交互动画播放1次）"],[1011,"仰卧起坐","27202",0.8,0,false,1,false,"触发交互动画时播放音效，停止交互动画时，停止音效（每播放1次交互动画播放1次）"],[1012,"举哑铃","27202",0.8,0,false,1,false,"触发交互动画时播放音效，停止交互动画时，停止音效（每播放1次交互动画播放1次）"],[1013,"扭蛋-演出","131833",0.8,0,false,1,false,"播放抽取动画时播放1次音效，出现抽卡结果时停止播放"],[1014,"扭蛋-结果","177696",1,0,false,1,false,"出现抽卡结果时播放1次音效，关闭抽卡结果界面时停止播放"],[2001,"购买龙娘卡片","136198",0.5,0,false,1,false,"购买龙娘卡片"],[2002,"装备龙娘卡片","203458",0.5,0,false,1,false,null],[2003,"卸下龙娘卡片","203458",0.5,0,false,1,false,null],[2004,"天赋树解锁","134424",0.5,0,false,1,false,null],[2005,"部署防御塔","204675",0.5,0,false,1,false,null],[2006,"升级防御塔","169179",0.5,0,false,1,false,null],[2007,"卖出防御塔","136198",0.5,0,false,1,false,null],[2008,"通关","169139",0.5,0,false,1,false,null],[2009,"失败","169180",0.5,0,false,1,false,null],[2010,"通关后点继续","199679",0.5,0,false,1,false,null],[2011,"开始游戏按钮","206005",0.5,0,false,1,false,null],[2012,"切换难度","204923",0.5,0,false,1,false,null],[2013,"领取任务奖励","169189",0.5,0,false,1,false,null]];
export interface IVoiceElement extends IElementBase{
 	/**唯一ID*/
	id:number
	/**名字*/
	Name:string
	/**音效GUID*/
	Guid:string
	/**音量可以超过1*/
	Volume:number
	/**音量距离 3d音效填写，非3d音效写0*/
	Distance:number
	/**是否为bgm*/
	IsBgm:boolean
	/**循环次数，暂时不读*/
	LoopCount:number
	/**是否循环*/
	isLoop:boolean
	/**备注*/
	Comment:string
 } 
export class VoiceConfig extends ConfigBase<IVoiceElement>{
	constructor(){
		super(EXCELDATA);
	}

}