import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","Info","IFcost","Type","Gold","Gem","imgGuid","Name","Loc","Guid","areaPoints","dropItemPlatform","minResourceCount"],["","","","","","","","Language","","","","",""],[1001,"商店",false,0,0,25000,"177826","AreaDivide_Name_1",new mw.Vector(945,500,479),null,[-4771,-660,4348,2324,-999,999],0,100],[1002,"城镇",false,0,0,6000,"174840","AreaDivide_Name_2",new mw.Vector(100,-1490,150),null,[-4771,-6530,4348,-700,-999,999],1000,130],[1003,"森林",true,1,4000,7500,"144238","AreaDivide_Name_3",new mw.Vector(100,-8285,150),"0218997B0FF469D1",[-4771,-14250,4348,-6550,-999,999],1000,120],[1004,"海滩",true,1,20000,10000,"180217","AreaDivide_Name_4",new mw.Vector(100,-14800,150),"03E2F6F5",[-4771,-20653,4348,-14260,-999,999],1000,100],[1005,"石矿",true,1,100000,12500,"180218","AreaDivide_Name_5",new mw.Vector(100,-21280,150),"32519069",[-4771,-27200,4348,-20660,-999,999],1000,100],[1006,"雪地",true,1,360000,12500,"174840","AreaDivide_Name_6",new mw.Vector(100,-28034,150),"13B48149",[-4771,-33950,4348,-27210,-999,999],1000,105],[1007,"冰川",true,1,1200000,12500,"174840","AreaDivide_Name_7",new mw.Vector(100,-34840,150),"3674D2A0",[-4771,-41000,4348,-33960,-999,999],1000,140],[1008,"海底",true,1,4000000,12500,"174840","AreaDivide_Name_8",new mw.Vector(100,-41690,150),"334C5F8B",[-4771,-47660,4348,-41010,-999,999],1000,120],[1009,"沙漠",true,1,10000000,25000,"174833","AreaDivide_Name_9",new mw.Vector(100,-48094,150),"21E5ED18",[-4771,-55900,4348,-47640,-999,999],1000,300],[1010,"帐篷",true,1,30000000,20000,"174840","AreaDivide_Name_10",new mw.Vector(-6021.7,-50088,153.5),"28492BFE",[-4771,-58445,4348,-55900,-999,999],0,100],[2001,"幻想商店",true,0,0,50000,"177826","AreaDivide_Name_12",new mw.Vector(-18213,99548,79507),null,[-16830.14,102196,-19881,98221.09,79361.22,80258.22],0,100],[2002,"魔法森林",true,0,0,20000,"180217","AreaDivide_Name_14",new mw.Vector(-18213,95737,79382),null,[-21625.14,90734.13,-16124.14,97548.13,78500.33,80482.33],81000,130],[2003,"传送门",true,3,60000,30000,"174840","AreaDivide_Name_13",new mw.Vector(-18502,91065,79383),"1CBF9F29",[-17138.14,91457.13,-20689.14,88270.13,79225.33,80482.33],0,100],[2004,"古代遗迹",true,3,136000,25000,"174840","AreaDivide_Name_15",new mw.Vector(-8460,119433,66060),"12BC0C283CCBEF38",[-5672.12,120735,-12464.12,113905,65708.25,66832],69155,40],[2005,"樱花庭院",true,3,840000,25000,"174840","AreaDivide_Name_16",new mw.Vector(-35726,97166,78810),"12BC0C282FD20A42",[-31135,99981,-40151,89573,77652,80577],81509,70],[2006,"糖果岛",true,3,5600000,25000,"174840","AreaDivide_Name_17",new mw.Vector(-32632,123920,79712),"12BC0C2810A52B8A",[-24966,117072,-36901,124859,79489,82332],82564,147],[2007,"墓地岛",true,3,29600000,25000,"174840","AreaDivide_Name_18",new mw.Vector(1326,97891,73279),"12BC0C282374F85D",[-1264,95949,6759,103610,73002,75359],75515,112],[2008,"地狱岛",true,3,106666665,30000,"174840","AreaDivide_Name_19",new mw.Vector(-9414,83875,77758),"12BC0C283F2D14B1",[-5456,86882,-12251,77509,77334,78540],79866,98],[2009,"天堂岛",true,3,240000000,35000,"174840","AreaDivide_Name_20",new mw.Vector(-15796,93357,93547),"12BC0C283D7AD291",[-20535,90706,-12992,102852,93142,95702],94882,59],[2010,"大天堂岛",true,3,1243200000,50000,"174840","AreaDivide_Name_21",new mw.Vector(-16397,104173,93530),"2B4A0E1C",[-18598,102457,-14197,110106,93189,95077],94882,100],[3001,"科技商店",true,0,0,65000,"177826","AreaDivide_Name_22",new mw.Vector(114503,-28767,10130),null,[111865,-28038,117890,-25488,9105,10585],0,100],[3002,"赛博城镇",true,0,0,30000,"174840","AreaDivide_Name_23",new mw.Vector(114503,-30595,10130),null,[111845,-36398,117360,-28500,9105,10585],0,100],[3003,"黑暗科技",true,4,50000,30000,"174840","AreaDivide_Name_24",new mw.Vector(114503,-37291,10130),"0892C365",[111845,-43583,117360,-36398,9105,10585],0,100],[3004,"蒸汽朋克",true,4,625000,30000,"174840","AreaDivide_Name_25",new mw.Vector(114503,-43719,10130),"36C0B9B7",[111845,-49870,117360,-43583,9105,10585],0,100],[3005,"蒸汽工厂",true,4,11500000,45000,"174840","AreaDivide_Name_26",new mw.Vector(111670,-46414,10130),"0E4385FA",[108970,-48045,112006,-44970,9105,10585],0,100],[3006,"黑暗实验",true,4,8250000,35000,"174840","AreaDivide_Name_27",new mw.Vector(114503,-50487,10130),"19EBFE2C",[111845,-56770,117360,-49870,9105,10585],0,100],[3007,"外星森林",true,4,72500000,40000,"174840","AreaDivide_Name_28",new mw.Vector(114503,-57340,10130),"3BF1E58F",[111845,-63565,117360,-56770,9105,10585],0,100],[3008,"阴暗森林",true,4,2500000000,65000,"174840","AreaDivide_Name_29",new mw.Vector(111524,-60155,10130),"04AFD82A",[108365,-61650,111520,-58970,9105,10585],0,100],[3009,null,true,4,350000000,50000,null,null,null,null,null,0,0],[3010,null,true,4,7500000000,65000,null,null,null,null,null,0,0]];
export interface IAreaDivideElement extends IElementBase{
 	/**id*/
	id:number
	/**区域说明（策划看）*/
	Info:string
	/**是否需要解锁1=需要；0=不需要*/
	IFcost:boolean
	/**货币种类（货币表id）*/
	Type:number
	/**解锁金币*/
	Gold:number
	/**传送钻石*/
	Gem:number
	/**图标*/
	imgGuid:string
	/**名字*/
	Name:string
	/**传送位置*/
	Loc:mw.Vector
	/**undefined*/
	Guid:string
	/**区域划分点坐标数组Xmin|Ymin|Xmax|Ymax*/
	areaPoints:Array<number>
	/**掉落物平台高度*/
	dropItemPlatform:number
	/**区域内资源刷新数量下限 默认100*/
	minResourceCount:number
 } 
export class AreaDivideConfig extends ConfigBase<IAreaDivideElement>{
	constructor(){
		super(EXCELDATA);
	}

}