import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","Info","IFcost","Type","Gold","Gem","imgGuid","Name","Loc","Guid","areaPoints"],["","","","","","","","Language","","",""],[1001,"商店",false,0,0,25000,"177826","AreaDivide_Name_1",new mw.Vector(945,500,479),null,[-4771,-660,4348,2324,-999,999]],[1002,"城镇",false,0,0,6000,"174840","AreaDivide_Name_2",new mw.Vector(100,-1490,150),null,[-4771,-7400,4348,-700,-999,999]],[1003,"森林",true,1,10000,7500,"144238","AreaDivide_Name_3",new mw.Vector(100,-8285,150),"0218997B0FF469D1",[-4771,-14090,4348,-7400,-999,999]],[1004,"海滩",true,1,75000,10000,"180217","AreaDivide_Name_4",new mw.Vector(100,-14800,150),"03E2F6F5",[-4771,-20766,4348,-14090,-999,999]],[1005,"石矿",true,1,400000,12500,"180218","AreaDivide_Name_5",new mw.Vector(100,-21280,150),"32519069",[-4771,-27423,4348,-20766,-999,999]],[1006,"雪地",true,1,1250000,12500,"174840","AreaDivide_Name_6",new mw.Vector(100,-28034,150),"13B48149",[-4771,-34130,4348,-27423,-999,999]],[1007,"冰川",true,1,5500000,12500,"174840","AreaDivide_Name_7",new mw.Vector(100,-34840,150),"3674D2A0",[-3525,-40895,3224,-34172,-999,999]],[1008,"海底",true,1,16500000,12500,"174840","AreaDivide_Name_8",new mw.Vector(100,-41690,150),"334C5F8B",[-4771,-47640,4348,-40895,-999,999]],[1009,"沙漠",true,1,50000000,25000,"174833","AreaDivide_Name_9",new mw.Vector(100,-48094,150),"250886BE",[-4771,-55900,4348,-47640,-999,999]],[1010,"帐篷",true,1,250000000,20000,"174840","AreaDivide_Name_10",new mw.Vector(100,-54195,150),"28492BFE",[-4771,-58445,4348,-55900,-999,999]],[1011,"秘密基地",true,1,7500000000,50000,"174833","AreaDivide_Name_11",new mw.Vector(-1464,-37085,150),"106FD01F",[-7300,-39052,-3455,-35407,-999,999]],[2001,"幻想商店",true,0,0,50000,"177826","AreaDivide_Name_12",new mw.Vector(-18302,99267,-14037),null,[-21561,98278,-14783,104238,-15004,-13394]],[2002,"魔法森林",true,0,0,20000,"180217","AreaDivide_Name_14",new mw.Vector(-18302,96475,-14069),null,[-20690,91073,-16377,97262,-15004,-13394]],[2003,"传送门",true,3,37500,30000,"174840","AreaDivide_Name_13",new mw.Vector(-18302,90517,-14069),"1CBF9F29",[-20690,88446,-16377,91073,-15004,-13394]],[2004,"古代遗迹",true,3,85000,25000,"174840","AreaDivide_Name_15",new mw.Vector(-8460,119780,-14069),"12BC0C283CCBEF38",[-11668,113094,-4126,120386,-14768,-13713]],[2005,"樱花庭院",true,3,525000,25000,"174840","AreaDivide_Name_16",new mw.Vector(-36522,97365,-14905),"12BC0C282FD20A42",[-38838,90404,-31186,98658,-16134,-14258]],[2006,"糖果岛",true,3,3500000,25000,"174840","AreaDivide_Name_17",new mw.Vector(-32852,124405,-14100),"12BC0C2810A52B8A",[-35867,117360,-27902,125355,-14961,-13326]],[2007,"墓地岛",true,3,18500000,25000,"174840","AreaDivide_Name_18",new mw.Vector(568,98366,-20491),"12BC0C282374F85D",[-2736,96606,5393,104096,-21326,-20000]],[2008,"地狱岛",true,3,66666666,30000,"174840","AreaDivide_Name_19",new mw.Vector(-9414,83875,-15927),"12BC0C283F2D14B1",[-12560,78095,-3969,85265,-16788,-15498]],[2009,"天堂岛",true,3,150000000,35000,"174840","AreaDivide_Name_20",new mw.Vector(-15699,93269,-72),"12BC0C283D7AD291",[-20861,91599,-8847,99651,-751,548]],[2010,"大天堂岛",true,3,777000000,50000,"174840","AreaDivide_Name_21",new mw.Vector(-16066,104197,-131),"33EFFD24",[-20974,102469,-11127,111556,-751,548]],[3001,"科技商店",true,0,0,65000,"177826","AreaDivide_Name_22",new mw.Vector(114503,-28767,10130),null,[111865,-28038,117890,-25488,9105,10585]],[3002,"赛博城镇",true,0,0,30000,"174840","AreaDivide_Name_23",new mw.Vector(114503,-30595,10130),null,[111845,-36398,117360,-28500,9105,10585]],[3003,"黑暗科技",true,4,50000,30000,"174840","AreaDivide_Name_24",new mw.Vector(114503,-37291,10130),"0892C365",[111845,-43583,117360,-36398,9105,10585]],[3004,"蒸汽朋克",true,4,625000,30000,"174840","AreaDivide_Name_25",new mw.Vector(114503,-43719,10130),"36C0B9B7",[111845,-49870,117360,-43583,9105,10585]],[3005,"蒸汽工厂",true,4,11500000,45000,"174840","AreaDivide_Name_26",new mw.Vector(111670,-46414,10130),"0E4385FA",[108970,-48045,112006,-44970,9105,10585]],[3006,"黑暗实验",true,4,8250000,35000,"174840","AreaDivide_Name_27",new mw.Vector(114503,-50487,10130),"19EBFE2C",[111845,-56770,117360,-49870,9105,10585]],[3007,"外星森林",true,4,72500000,40000,"174840","AreaDivide_Name_28",new mw.Vector(114503,-57340,10130),"3BF1E58F",[111845,-63565,117360,-56770,9105,10585]],[3008,"阴暗森林",true,4,2500000000,65000,"174840","AreaDivide_Name_29",new mw.Vector(111524,-60155,10130),"04AFD82A",[108365,-61650,111520,-58970,9105,10585]],[3009,null,true,4,350000000,50000,null,null,null,null,null],[3010,null,true,4,7500000000,65000,null,null,null,null,null]];
export interface IAreaDivideElement extends IElementBase{
 	/**id*/
	id:number
	/**区域说明（策划看）*/
	Info:string
	/**是否需要解锁1=需要；0=不需要*/
	IFcost:boolean
	/**货币种类（货币表id）*/
	Type:number
	/**解锁金币*/
	Gold:number
	/**传送钻石*/
	Gem:number
	/**图标*/
	imgGuid:string
	/**名字*/
	Name:string
	/**传送位置*/
	Loc:mw.Vector
	/**墙的Guid*/
	Guid:string
	/**区域划分点坐标数组Xmin|Ymin|Xmax|Ymax*/
	areaPoints:Array<number>
 } 
export class AreaDivideConfig extends ConfigBase<IAreaDivideElement>{
	constructor(){
		super(EXCELDATA);
	}

}