import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","Guid","ResourceName"],["","",""],[1,"14031","背景音乐（每个世界不同）"],[2,"134704","玩家脚步声（移动时触发，停止移动停止，挂在玩家身上，其他玩家也听得到）"],[3,"130809","跳跃声（离开地面时触发，挂在玩家身上）"],[4,"120839","落地音效"],[5,"169132","喷泉处水流的声音（策划直接摆在场景里）"],[6,"159241","可破坏资源掉落到地面时的声音（古墩一下，所有人可以听到，资源位置播放）"],[7,"134703","按钮点击音效（只有自己可以听到）"],[8,"148670","宠物移动音效（宠物落地时播放 只有地面宠物有）"],[9,"145623","领取奖励时的烟花音效（只有自己可以听到）"],[10,"39328","宠物装备时的音效 嗖一下（只有自己可以听到）"],[11,"128511","资源物被破坏时的音效（所有人可以听到，资源位置播放）"],[12,"148670","宠物出战时的音效 （只有自己可以听到，由跟随状态变为寻找资源状态时）"],[13,"136198","资源进入玩家时的音效（只有自己可以听到，玩家吸收到金币时触发）"],[14,"176226","资源物被暴击破坏时的音效（所有人可以听到，资源位置播放）"]];
export interface IAssetsElement extends IElementBase{
 	/**唯一ID*/
	id:number
	/**GUID*/
	Guid:string
	/**资源描述*/
	ResourceName:string
 } 
export class AssetsConfig extends ConfigBase<IAssetsElement>{
	constructor(){
		super(EXCELDATA);
	}

}