import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","TaskInfo","Area","Star","Type","NumA","NumB","Text","Points","UI"],["","","","","","","","Language","",""],[1,"城镇金币堆5",1002,1,1,[3,4,5],5,"Task_Info_1",40,"13BD434A"],[2,"城镇扭蛋获得10只宠物",1002,2,2,[1,2,3,4,5],10,"Task_Info_2",100,null],[3,"在城镇打破10个箱子",1002,3,1,[7,8],20,"Task_Info_3",250,null],[4,"森林中破坏20个纸箱",1003,1,1,[14],20,"Task_Info_4",40,"295FD745"],[5,"进行五次升级",1003,2,3,[1],5,"Task_Info_5",100,null],[6,"在森林蛋中孵化300只宠物",1003,3,2,[1,2,3,4,5],300,"Task_Info_6",250,null],[7,"在海滩打破25个钻石箱子",1004,1,1,[18],25,"Task_Info_7",40,"3C148A4A"],[8,"使用爱心化机器10次",1004,2,3,[2],10,"Task_Info_8",100,null],[9,"融合出20只稀有以上的宠物",1004,3,4,[2,3,4,5],20,"Task_Info_9",250,null],[10,"从石矿蛋中孵化50只宠物",1005,1,2,[1,2,3,4,5],50,"Task_Info_10",40,"0B370203"],[11,"使用彩虹化机器10次",1005,2,3,[3],10,"Task_Info_11",100,null],[12,"打破封闭宝箱75个",1005,3,1,[32],75,"Task_Info_12",250,null],[13,"在雪地破坏40个纸箱",1006,1,1,[38],40,"Task_Info_13",40,"0513D722"],[14,"在雪地蛋中孵化5只史诗宠物",1006,2,2,[3],5,"Task_Info_14",100,null],[15,"在雪地破坏100个宝箱",1006,3,1,[39,40],100,"Task_Info_15",250,null],[16,"成功完成5次交易",1007,1,5,[1],5,"Task_Info_16",40,"0A49046D"],[17,"在冰川蛋中孵化70只宠物",1007,2,2,[1,2,3,4,5],70,"Task_Info_17",100,null],[18,"在冰川打破100个宝箱",1007,3,1,[47,48],100,"Task_Info_18",250,null],[19,"在海底打破100个钻石",1008,1,1,[49,50],100,"Task_Info_19",40,"23092742"],[20,"从海底蛋中孵化50只稀有以上的宠物",1008,2,2,[2,3,4,5],50,"Task_Info_20",100,null],[21,"在海底打破120个宝箱",1008,3,1,[55,56],120,"Task_Info_21",250,null],[22,"在沙漠打破10个巨型箱子",1009,1,1,[65],10,"Task_Info_22",40,"3C55900E"],[23,"在沙漠蛋中孵化出25只传说宠物",1009,2,2,[4,5],25,"Task_Info_23",100,null],[24,"完成50次交易",1009,3,5,[2],50,"Task_Info_24",250,null],[25,"在魔法森林蛋孵化10只宠物",2002,1,2,[1,2,3,4,5],10,"Task_Info_25",40,"1C31AB41"],[26,"在魔法森林破坏20个宝箱",2002,2,1,[74,75],20,"Task_Info_26",100,null],[27,"使用附魔机100次 ",2002,3,3,[4],100,"Task_Info_27",250,null],[28,"在遗迹岛打破50个纸箱",2004,1,1,[81],50,"Task_Info_28",40,"37731FD4"],[29,"在遗迹蛋中孵化100只宠物",2004,2,2,[1,2,3,4,5],100,"Task_Info_29",100,null],[30,"在遗迹岛打破60次巨型箱子",2004,3,1,[67],60,"Task_Info_30",250,null],[31,"完成50次交易",2005,1,5,[3],50,"Task_Info_31",40,"0DC395AC"],[32,"在武士岛孵化2只传奇宠物",2005,2,2,[4],2,"Task_Info_32",100,null],[33,"在武士岛破坏500个钻石",2005,3,1,[84,85],500,"Task_Info_33",250,null]];
export interface ITaskElement extends IElementBase{
 	/**唯一id*/
	id:number
	/**任务描述（策划用）*/
	TaskInfo:string
	/**对应区域，区域划分表id*/
	Area:number
	/**星级 */
	Star:number
	/**分类1=破坏物；2=宠物；3=强化（升级爱心彩虹附魔）；4=融合，5=交易（完成上一条任务，下一条才开始计数）*/
	Type:number
	/**参数A（数组代表几种都可）：
type=1，A=破坏物对应的id；
type=2，A=宠物稀有度id（宠物表）；type=3，A=强化类型（1升级，2爱心，3彩虹*/
	NumA:Array<number>
	/**4=附魔）；
type=4，A=成功融合出目标的稀有度
type=5，A=优先要完成的顺序*/
	NumB:number
	/**参数B：
type=1，B=破坏物数量；
type=2，B=宠物数量；
type=3，B=强化次数
type=4，B=融合目标的数量
type=5，B=成功完成交易的次数*/
	Text:string
	/**任务对应的多语言文本
*/
	Points:number
	/**奖励的任务点数*/
	UI:string
 } 
export class TaskConfig extends ConfigBase<ITaskElement>{
	constructor(){
		super(EXCELDATA);
	}

}