export const RunesConfig = {
    // 物理基础（天赋树）
    adBonus: [0, 0, 0, 0, 0],
    // 魔法学识+（天赋树）
    apBonus: [0, 0, 0, 0, 0],
    // 攻速增强+（天赋树）
    attackSpeed: [0, 0, 0, 0, 0],
    // 距离增强+（天赋树）
    attackRange: [0, 0, 0, 0],
    // 光元素伤害加成（天赋树）(百分比)
    lightBonus: [0, 0, 0, 0, 0],
    // 暗元素伤害加成（天赋树）(百分比)
    darkBonus: [0, 0, 0, 0, 0],
    // 水元素伤害加成（天赋树）(百分比)
    waterBonus: [0, 0, 0, 0, 0],
    // 火元素伤害加成（天赋树）(百分比)
    fireBonus: [0, 0, 0, 0, 0],
    // 土元素伤害加成（天赋树）(百分比)
    earthBonus: [0, 0, 0, 0, 0],
    // 木元素伤害加成（天赋树）(百分比)
    woodBonus: [0, 0, 0, 0, 0],
    // 物理斩杀（天赋树）（低于20%造成x%额外伤害）
    adExecute: [0, 0],
    // 魔法压制（天赋树）（魔法对于血量高于80%造成x%额外伤害）
    apExecute: [0, 0],
    // 高射火炮（天赋树）（空中单位造成伤害提升x%）
    flyingBonus: [0, 0, 0, 0],
    // 物理精通（天赋树）
    adBonus2: [0, 0, 0, 0, 0],
    // 魔法升华+（天赋树）
    apBonus2: [0, 0, 0, 0, 0],
    // 攻速增强++（天赋树）
    attackSpeed2: [0, 0, 0, 0, 0],
    // 距离增强++（天赋树）
    attackRange2: [0, 0, 0, 0],
    // 光元素伤害加成（天赋树）(百分比)
    lightBonus2: [0, 0, 0, 0, 0],
    // 暗元素伤害加成（天赋树）(百分比)
    darkBonus2: [0, 0, 0, 0, 0],
    // 水元素伤害加成（天赋树）(百分比)
    waterBonus2: [0, 0, 0, 0, 0],
    // 火元素伤害加成（天赋树）(百分比)
    fireBonus2: [0, 0, 0, 0, 0],
    // 土元素伤害加成（天赋树）(百分比)
    earthBonus2: [0, 0, 0, 0, 0],
    // 木元素伤害加成（天赋树）(百分比)
    woodBonus2: [0, 0, 0, 0, 0],
    // 物理斩杀（天赋树）（低于20%造成x%额外伤害）
    adExecute2: [0, 0],
    // 魔法压制（天赋树）（魔法对于血量高于80%造成x%额外伤害）
    apExecute2: [0, 0],
    // 高射火炮（天赋树）（空中单位造成伤害提升x%）
    flyingBonus2: [0, 0, 0, 0],

    // 基地血量增加（天赋树）
    userHP: [0.1, 0, 0, 0, 0],
    // 每回合获得金币（天赋树）
    goldAmount: [0, 0, 0, 0],
    // 每回合回复血量（天赋树）
    hpAmount: [0, 0, 0, 0],
    // 产出金币效率提升x%（天赋树）
    goldAffect: [0, 0, 0, 0, 0],
    // 基地血量增加（天赋树）
    userHP2: [0.1, 0, 0, 0, 0],
    // 每回合获得金币（天赋树）
    goldAmount2: [0, 0, 0, 0],
    // 每回合回复血量（天赋树）
    hpAmount2: [0, 0, 0, 0],
    // 产出金币效率提升x%（天赋树）
    goldAffect2: [0, 0, 0, 0, 0],

    // 全体怪物受到伤害增加x%（天赋树）
    damageBonus: [0, 0, 0, 0],
    // 怪物入场5秒减速（天赋树）如果是减速用负数
    speedBonus: [0, 0, 0, 0, 0],
    // 元素克制时额外造成x%伤害（天赋树）
    counter: [0, 0, 0],
    // 元素被克制时减少x%伤害削弱（天赋树）
    countered: [0, 0, 0],
    // 怪物出场前10秒护甲减少x （天赋树）如果是减护甲用负数
    armorBonus: [0, 0, 0, 0],
    // 怪物出场前10秒法抗减少x （天赋树）如果是减魔抗用负数
    MRBonus: [0, 0, 0, 0],
    // 怪物入场5秒减速（天赋树）如果是减速用负数
    speedBonus2: [0, 0, 0, 0, 0],
    // 怪物出场前10秒护甲减少x （天赋树）如果是减护甲用负数
    armorBonus2: [0, 0, 0, 0],
    // 怪物出场前10秒法抗减少x （天赋树）如果是减魔抗用负数
    MRBonus2: [0, 0, 0, 0],

    //物理（龙娘祝福）
    adBonusD: [0, 0, 0],
    // 魔法（龙娘祝福）
    apBonusD: [0, 0, 0],
    // 攻击距离（龙娘祝福）
    attackRangeD: [0, 0, 0],
    // 减速固定值 (龙娘祝福）如果是减速用负数
    speedBonusD: [0, 0, 0],
    // 基地血量 (龙娘祝福）
    userHPD: [0.1, 0, 0],
    // 攻击速度 (龙娘祝福）
    attackSpeedD: [0, 0, 0],
};
