import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","guid","volume","loopNum","type"],["","","","",""],[1,"203939",0.4,1,2,"脚步声1"],[2,"203939",0.3,1,2,"脚步声2"],[101,"233030",1,1,2,"道具丢弃落地"],[102,"233022",1,1,2,"女生死亡音效"],[103,"233031",1,1,2,"男生死亡音效"],[104,"137565",1,1,2,"鬼击打人的声音"],[200,"234476",1,1,1,"起床音效"],[1000,"264217",1,0,0,"游戏内bgm（白天背景音乐）"],[1001,"233038",1,0,0,"主菜单、难度选择、存档选择bgm"],[1002,"233040",1,1,1,"按钮按下"],[1003,"202881",1,1,1,"出生音效"],[1004,"203853",1,1,1,"主界面-》难度选择"],[1005,"199443",1,1,1,"难度选择界面-》背景介绍界面"],[2001,"140368",1,0,0,"夜晚背景音乐"],[2002,"200445",1,0,0,"入夜/黎明前10s左右的过渡音效（衔接作用）"],[2003,"205542",1,1,1,"拾取建筑/道具/果实"],[2004,"204460",1,1,1,"建造建筑"],[2005,"134423",1,1,1,"食用果实"],[2006,"259570",1,1,1,"跳跃"],[2007,"136197",1,1,1,"回血"],[2008,"205096",1,1,1,"蜘蛛网弹起玩家"],[2009,"210053",1,1,2,"鬼移动时，不时发出叫声（每次间隔5-10秒）"],[2010,"204176",1,1,2,"鬼攻击建筑的声音"],[2011,"210123",1,1,2,"鬼移动随机2"],[2012,"210019",1,1,2,"鬼移动随机3"],[2013,"210133",1,1,2,"鬼移动随机4"],[2014,"203271",1,1,2,"鬼移动随机5"],[2015,"210080",1,1,2,"鬼移动随机6"]];
export interface ISoundElement extends IElementBase{
 	/**id*/
	id:number
	/**音效guid*/
	guid:string
	/**音量大小（0~1）*/
	volume:number
	/**播放次数（0为无限次）*/
	loopNum:number
	/**音效类型:
0. bgm
1. 2D音效
2. 3D音效*/
	type:number
 } 
export class SoundConfig extends ConfigBase<ISoundElement>{
	constructor(){
		super(EXCELDATA);
	}

}